Tekla Open API Reference for Tekla Structures 2025
ViewMarkTagAttributes Methods
The View.ViewMarkTagAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewMarkBasicTagAttributes.IsEqual(Object).)
Top
See Also
Reference
View.ViewMarkTagAttributes Class
Tekla.Structures.Drawing Namespace